import numpy as np
# 导入绘图库
from matplotlib import pyplot as plt

# 前面几节介绍了创建简单ndarray，特殊的全1和全0ndarray，固定范围的等差和等比ndarray

# 如何生成随机数组
# 这一节介绍高斯分布

# np.random库

# 1.np.random.normal(loc=0.0,scale=1.0,size=None)
# loc是均值，scale是标准差，size是输出的shape,None是只输出一个值，一般不这么用。
a1=np.random.normal(0,1,[2,3,2,2])  # 输出一个标准高斯分布的四维张量
print(a1,a1.shape)
# 均值为0，标准差为1时为标准高斯分布
# [[[[ 1.1244993  -0.22113347]
#    [ 1.36295794  0.90639578]]
#
#   [[-0.38870192 -1.32805962]
#    [ 0.94530846  0.7521543 ]]
#
#   [[-0.31475316  1.40567243]
#    [ 0.81122653 -1.98215594]]]
#
#
#  [[[ 0.94297978 -0.58889543]
#    [-1.60551956 -1.00178583]]
#
#   [[-0.24627754  1.26430055]
#    [-0.05329579 -1.11713611]]
#
#   [[ 0.89643343  0.94517029]
#    [ 1.30138899  0.31913908]]]] (2, 3, 2, 2)

# 2.np.random.standard_normal(size=None)  # 标准高斯分布，因为均值和标准差已经指定，所以只需输入shape
a2=np.random.standard_normal([2,3,2,2])
print(a2,a2.shape)
# [[[[ 0.50190365  0.54021805]
#    [ 1.94485171 -1.71075517]]
#
#   [[-0.34312023  0.44393574]
#    [-1.55859493  0.66969152]]
#
#   [[ 0.86317023 -0.90072851]
#    [-0.28815925 -0.15847719]]]
#
#
#  [[[ 0.02401782 -0.55345067]
#    [ 0.56434304  1.00911151]]
#
#   [[ 1.66449159  0.98958402]
#    [ 0.74017136 -0.14392877]]
#
#   [[ 0.16927928 -0.29270507]
#    [ 1.18767156 -0.05061462]]]] (2, 3, 2, 2)

# 展示高斯分布
a3=np.random.normal(0,1,1000000)
# 创建画布
plt.figure(1,figsize=(20,10),dpi=120)
# 画图
plt.hist(a3,1000)
# 保存
plt.savefig('gauss.png')
# 展示
plt.show()

# 学习一下列表生成式
t=['liu{}'.format(i+1) for i in range(4)]
print(t)
# 同样的效果，但列表生成式更简洁
t2=[]
for i in range(4):
   t2.append('liu{}'.format(i+1))
print(t2)

print(['{}'.format(str(i)) for i in range(4)])

# 世界上最常见的就是gauss分布，接下来讲另一种随机分布-均匀分布
# np.random.uniform(low=0.0,high=1.0,size=None)
# 从一个均匀分布中随机采样，左包又不包，low是下界，默认0，high是上界，默认1，size输出样本数目
# np.random.randint(low=0,high=1,size=None,dtype)
# 生成一个整数数组或N维整数数组
b1=np.random.uniform(-1,1,10000)
print(b1)

# 分布得很均匀
plt.figure(figsize=(20,8),dpi=100)
plt.hist(b1)
plt.show()


# 小结：随机数组，高斯分布，均匀分布都是随机分布，生成随机数组


























